number = int(input("შეიყვანე ნებისმიერი მთელი რიცხვი: "))
sum = 0
for i in range(1, number + 1):
 sum += i  
print("ყველა რიცხვის ჯამი არის:", sum)



number = int(input("შეიყვანე ნებისმიერი მთელი რიცხვი: "))
sum = 0
for i in range(1, number + 1):
    if i % 2 != 0:  
        sum += i  
print("მხოლოდ კენტი რიცხვების ჯამი არის:", sum)


password = "secret123"

# მომხმარებელი ცდილობს გამოიცნოს პაროლი
guess = input("შეიყვანე პაროლი: ")

#თუ პაროლი არ დაემთხვევა
while guess != password:
    print("არასწორი პაროლი, სცადე თავიდან.")
    guess = input("შეიყვანე პაროლი: ")

#თუ პაროლი დაემტხვა 
print("პაროლი სწორად გამოიცანი!")


i = 1

# სანამ i ნაკლებია ან ტოლია 100-ზე
while i <= 100:
    if i % 2 != 0:  # თუ რიცხვი კენტია
        print(i)
    i += 1  # i-ს ვზრდით 1-ით
